# IsDetailed Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..IsDetailed Method
StructuralConnectionHandler Class See Also
---
Checks if Structural Connection Handler has the detailed connection style.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsDetailed()
```

Visual Basic
---
```text
Public Function IsDetailed As Boolean
```

Visual C++
---
```text
public:
bool IsDetailed()
```

# ### Return Value
True if Structural Connection Handler has the detailed connection style.
# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace